Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Клиенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАбонемента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипАбонемента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Клиенты/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Функция мПривестиКДате(Представление, ТипРеквизита, Примечание = "")
	
	Результат = ТипРеквизита.ПривестиЗначение(Представление);
	Если Результат = '00010101' Тогда
		
		МассивЧастей = ПолучитьЧастиПредставленияДаты(Представление);
		Если ТипРеквизита.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
			
			Попытка
				
				Если МассивЧастей.Количество() = 3 Тогда
					Результат = Дата(1,1,1, МассивЧастей[0],МассивЧастей[1],МассивЧастей[2]);
				ИначеЕсли МассивЧастей.Количество() = 6 Тогда
					Результат = Дата(1,1,1, МассивЧастей[3],МассивЧастей[4],МассивЧастей[5]);
				КонецЕсли;
				
			Исключение
				Примечание = "Неправильный формат даты";
			КонецПопытки;
			
		ИначеЕсли МассивЧастей.Количество() = 3 или МассивЧастей.Количество() = 6 Тогда
			
			Если МассивЧастей[0] >= 1000 Тогда
				Временно = МассивЧастей[0];
				МассивЧастей[0] = МассивЧастей[2];
				МассивЧастей[2] = Временно;
			КонецЕсли;
			
			Если МассивЧастей[2] < 100 Тогда
				МассивЧастей[2] = МассивЧастей[2] + ?(МассивЧастей[2] < 30, 2000,1900);
			КонецЕсли;
			
			Попытка
				Если МассивЧастей.Количество() = 3 или ТипРеквизита.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
					Результат = Дата(МассивЧастей[2],МассивЧастей[1],МассивЧастей[0]);
				Иначе
					Результат = Дата(МассивЧастей[2],МассивЧастей[1],МассивЧастей[0],МассивЧастей[3],МассивЧастей[4],МассивЧастей[5]);
				КонецЕсли;
			Исключение
				Примечание = "Неправильный формат даты";
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьЧастиПредставленияДаты(ЗНАЧ Представление)
	
	МассивЧастей = Новый Массив;
	НачалоЦифры = 0;
	Для к = 1 По СтрДлина(Представление) Цикл
		
		Символ = Сред(Представление, к ,1);
		ЭтоЦифра = Символ >= "0" и Символ <= "9";
		
		Если ЭтоЦифра Тогда
			
			Если НачалоЦифры = 0 Тогда
				НачалоЦифры = к;
			КонецЕсли;
			
		Иначе
			
			Если Не НачалоЦифры = 0 Тогда
				МассивЧастей.Добавить(Число(Сред(Представление,НачалоЦифры, к - НачалоЦифры)));
			КонецЕсли;
			
			НачалоЦифры = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не НачалоЦифры = 0 Тогда
		МассивЧастей.Добавить(Число(Сред(Представление,НачалоЦифры)));
	КонецЕсли;
	
	Возврат МассивЧастей;
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
    // Открываем диалоговое окно для выбора файла
    ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    ДиалогОткрытияФайла.Заголовок = "Выберите файл для загрузки";
    ДиалогОткрытияФайла.Фильтр = "Текстовые файлы (*.txt)|*.txt|Файлы Excel (*.xls, *.xlsx)|*.xls;*.xlsx|CSV файлы (*.csv)|*.csv";
    
    Если ДиалогОткрытияФайла.Выбрать() Тогда
        ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
        
        // Определяем расширение файла
        ПозицияТочки = СтрНайти(ПутьКФайлу, ".");
        Если ПозицияТочки > 0 Тогда
            Расширение = Сред(ПутьКФайлу, ПозицияТочки);
        Иначе
            Сообщить("Файл не имеет расширения.");
            Возврат;
        КонецЕсли;
        
        Если Лев(Расширение, 4) = ".txt" Или Лев(Расширение, 4) = ".csv" Тогда
            Данные = ЗагрузитьИзTXTИлиCSV(ПутьКФайлу);
        ИначеЕсли Лев(Расширение, 4) = ".xls" Или Лев(Расширение, 5) = ".xlsx" Тогда
            Данные = ЗагрузитьИзExcel(ПутьКФайлу);
        Иначе
            Сообщить("Неподдерживаемый формат файла.");
            Возврат;
        КонецЕсли;
        
        ОбработатьДанныеНаСервере(Данные); // Вызов серверной процедуры
    Иначе
        Сообщить("Файл не выбран.");
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьИзTXTИлиCSV(Путь)
    ЧтениеТекста = Новый ЧтениеТекста(Путь);
    Данные = ЧтениеТекста.Прочитать();
    ЧтениеТекста.Закрыть();
    Возврат Данные;
КонецФункции

&НаСервере
Функция ЗагрузитьИзExcel(Путь)
    Данные = "";
    
    Попытка
        // Создаем COM-объект для работы с Excel
        Excel = Новый COMОбъект("Excel.Application");
        Excel.Visible = Ложь; // Скрываем окно Excel
        Книга = Excel.Workbooks.Open(Путь);
        Лист = Книга.Sheets(1); // Выбираем первый лист
        
        // Читаем данные из листа
        КоличествоСтрок = Лист.UsedRange.Rows.Count;
        КоличествоКолонок = Лист.UsedRange.Columns.Count;
        
        Для Строка = 1 По КоличествоСтрок Цикл
            СтрокаДанных = "";
            Для Колонка = 1 По КоличествоКолонок Цикл
                ЗначениеЯчейки = Лист.Cells(Строка, Колонка).Text;
                СтрокаДанных = СтрокаДанных + ?(СтрокаДанных = "", "", ";") + СокрЛП(ЗначениеЯчейки);
            КонецЦикла;
            Данные = Данные + ?(Данные = "", "", Символы.ПС) + СтрокаДанных;
        КонецЦикла;
        
        // Закрываем книгу и Excel
        Книга.Close(Ложь);
        Excel.Quit();
    Исключение
        Сообщить("Ошибка при чтении Excel-файла: " + ОписаниеОшибки());
    КонецПопытки;
    
    Возврат Данные;
КонецФункции

&НаСервере
Процедура ОбработатьДанныеНаСервере(Данные)
    Строки = СтрРазделить(Данные, Символы.ПС);
    ПропуститьЗаголовок = Истина; // Пропуск первой строки (заголовок)
    
    Для Каждого Строка Из Строки Цикл
        Если ПропуститьЗаголовок Тогда
            ПропуститьЗаголовок = Ложь;
            Продолжить;
        КонецЕсли;
        
        Если Строка = "" Тогда
            Продолжить;
        КонецЕсли;
        
        Колонки = СтрРазделить(Строка, ";");
        
        // Проверяем, что в строке достаточно колонок
        Если Колонки.Количество() < 6 Тогда
            Сообщить("Ошибка формата: " + Строка);
            Продолжить;
        КонецЕсли;
        
        Попытка
            Код              = Число(СокрЛП(Колонки[0]));
            Наименование     = СокрЛП(Колонки[1]);
            
            // Преобразуем дату с использованием функции мПривестиКДате
            ДатаРожденияСтрока = СокрЛП(Колонки[2]);
            ДатаРождения = мПривестиКДате(ДатаРожденияСтрока, Новый ОписаниеТипов("Дата"));
            Если ДатаРождения = '00010101' Тогда
                Сообщить("Ошибка преобразования даты в строке: " + Строка);
                Продолжить;
            КонецЕсли;
            
            НомерТелефона    = СокрЛП(Колонки[3]);
            Email            = СокрЛП(Колонки[4]);
            
            // Получаем тип абонемента
            ТипАбонементаСтрока = СокрЛП(Колонки[5]);
            ТипАбонемента = Справочники.ТипАбонемента.НайтиПоНаименованию(ТипАбонементаСтрока);
            Если ТипАбонемента = Неопределено Тогда
                Сообщить("Ошибка: тип абонемента '" + ТипАбонементаСтрока + "' не найден в строке: " + Строка);
                Продолжить;
            КонецЕсли;
            
            // Поиск элемента по коду через запрос
            Запрос = Новый Запрос;
            Запрос.Текст = 
                "ВЫБРАТЬ 
                |    Ссылка 
                |ИЗ 
                |    Справочник.Клиенты КАК Клиенты 
                |ГДЕ 
                |    Клиенты.Код = &Код";
            Запрос.УстановитьПараметр("Код", Код);
            Результат = Запрос.Выполнить();
            Выборка = Результат.Выбрать();
            
            Если Выборка.Следующий() Тогда
                СсылкаКлиент = Выборка.Ссылка;
                ОбъектКлиент = СсылкаКлиент.ПолучитьОбъект();
                Сообщить("Обновлен существующий элемент: " + Код);
            Иначе
                ОбъектКлиент = Справочники.Клиенты.СоздатьЭлемент();
                ОбъектКлиент.Код = Код;
                Сообщить("Создан новый элемент: " + Код);
            КонецЕсли;
            
            // Заполнение реквизитов
            ОбъектКлиент.Наименование = Наименование;
            ОбъектКлиент.ДатаРождения = ДатаРождения;
            ОбъектКлиент.НомерТелефона = НомерТелефона;
            ОбъектКлиент.Email = Email;
            ОбъектКлиент.ТипАбонемента = ТипАбонемента; // Загружаем тип абонемента в документ
            
            // Сохранение изменений
            ОбъектКлиент.Записать();
            Сообщить("Сохранено: " + Код);
            
        Исключение
            Сообщить("Ошибка в строке: " + Строка + " | " + ОписаниеОшибки());
        КонецПопытки;
    КонецЦикла;
КонецПроцедуры

&НаСервере
Функция НайтиИлиСоздатьЭлементСправочника(ИмяСправочника, Наименование)
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ 
        |    Ссылка 
        |ИЗ 
        |    Справочник." + ИмяСправочника + " КАК Элемент 
        |ГДЕ 
        |    Элемент.Наименование = &Наименование";
    Запрос.УстановитьПараметр("Наименование", Наименование);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Ссылка;
    Иначе
        НовыйЭлемент = Справочники[ИмяСправочника].СоздатьЭлемент();
        НовыйЭлемент.Наименование = Наименование;
        НовыйЭлемент.Записать();
        Возврат НовыйЭлемент.Ссылка;
    КонецЕсли;
КонецФункции
&НаКлиенте
Процедура Выгрузить(Команда)
    // Формируем данные
    ТекстДляВыгрузки = СформироватьТекстДляВыгрузкиНаСервере();
    
    // Создаем диалог выбора файла
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    Диалог.Заголовок = "Сохранить файл";
    Диалог.Фильтр = "Текстовые файлы (*.txt)|*.txt|CSV файлы (*.csv)|*.csv|Excel файлы (*.xls)|*.xls|Word файлы (*.docx)|*.docx";
    
    // Устанавливаем имя файла по умолчанию
    ИмяФайлаПоУмолчанию = "Выгрузка_клиентов.txt";
    Диалог.ПолноеИмяФайла = ИмяФайлаПоУмолчанию;
    
    Если Диалог.Выбрать() Тогда
        ВыбранныйФайл = Диалог.ПолноеИмяФайла;
        
        Попытка
            // Определяем формат по расширению
            Расширение = нРег(Прав(ВыбранныйФайл, 4));
            
            Если Расширение = ".txt" Тогда
                СохранитьВTXT(ВыбранныйФайл, ТекстДляВыгрузки);
            ИначеЕсли Расширение = ".csv" Тогда
                СохранитьВCSV(ВыбранныйФайл, ТекстДляВыгрузки);
            ИначеЕсли Расширение = ".xls" Тогда
                СохранитьВXLS(ВыбранныйФайл);
            ИначеЕсли Расширение = ".docx" Тогда
                СохранитьВDOCX(ВыбранныйФайл);
            КонецЕсли;
            
            Сообщить("Файл сохранен: " + ВыбранныйФайл);
        Исключение
            Сообщить("Ошибка: " + ОписаниеОшибки());
        КонецПопытки;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьТекстДляВыгрузкиНаСервере()
    // Получаем данные из справочника Клиенты
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    Клиенты.Код КАК Код,
        |    Клиенты.Наименование КАК Наименование,
        |    Клиенты.ДатаРождения КАК ДатаРождения,
        |    Клиенты.НомерТелефона КАК НомерТелефона,
        |    Клиенты.Email КАК Email,
        |    Клиенты.ТипАбонемента.Наименование КАК ТипАбонемента
        |ИЗ
        |    Справочник.Клиенты КАК Клиенты";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат "";
    КонецЕсли;
    
    // Формируем заголовки
    Заголовки = "Код;Наименование;ДатаРождения;НомерТелефона;Email;ТипАбонемента";
    Результат = Заголовки + Символы.ПС;
    
    // Формируем строки данных
    Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
        Результат = Результат + 
            Строка(Выборка.Код) + ";" +
            Строка(Выборка.Наименование) + ";" +
            Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy") + ";" +
            Строка(Выборка.НомерТелефона) + ";" +
            Строка(Выборка.Email) + ";" +
            Строка(Выборка.ТипАбонемента) + Символы.ПС;
    КонецЦикла;
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СохранитьВTXT(Путь, Данные)
    ЗаписьТекста = Новый ЗаписьТекста(Путь);
    ЗаписьТекста.ЗаписатьСтроку(Данные);
    ЗаписьТекста.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВCSV(Путь, Данные)
    Данные = СтрЗаменить(Данные, "
    |", Символы.ПС);
    ЗаписьТекста = Новый ЗаписьТекста(Путь);
    ЗаписьТекста.ЗаписатьСтроку(Данные);
    ЗаписьТекста.Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьВXLS(Путь)
    // Используем COM-объект Excel для создания XLS
    Excel = Новый COMОбъект("Excel.Application");
    Excel.Visible = Ложь;
    Книга = Excel.Workbooks.Add();
    Лист = Книга.Worksheets(1);
    
    // Заголовки таблицы
    Лист.Cells(1, 1).Value = "Код";
    Лист.Cells(1, 2).Value = "Наименование";
    Лист.Cells(1, 3).Value = "ДатаРождения";
    Лист.Cells(1, 4).Value = "НомерТелефона";
    Лист.Cells(1, 5).Value = "Email";
    Лист.Cells(1, 6).Value = "ТипАбонемента";
    
    // Получаем данные из справочника Клиенты
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    Клиенты.Код КАК Код,
        |    Клиенты.Наименование КАК Наименование,
        |    Клиенты.ДатаРождения КАК ДатаРождения,
        |    Клиенты.НомерТелефона КАК НомерТелефона,
        |    Клиенты.Email КАК Email,
        |    Клиенты.ТипАбонемента.Наименование КАК ТипАбонемента
        |ИЗ
        |    Справочник.Клиенты КАК Клиенты";
    
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    // Заполняем таблицу данными
    Для i = 1 По РезультатЗапроса.Количество() Цикл
        Выборка.Следующий();
        Лист.Cells(i + 1, 1).Value = Выборка.Код;
        Лист.Cells(i + 1, 2).Value = Выборка.Наименование;
        Лист.Cells(i + 1, 3).Value = Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy");
        Лист.Cells(i + 1, 4).Value = Выборка.НомерТелефона;
        Лист.Cells(i + 1, 5).Value = Выборка.Email;
        Лист.Cells(i + 1, 6).Value = Выборка.ТипАбонемента;
    КонецЦикла;
    
    Книга.SaveAs(Путь);
    Книга.Close();
    Excel.Quit();
КонецПроцедуры

&НаСервере
Процедура СохранитьВDOCX(Путь)
    // Используем COM-объект Word для создания DOCX
    Word = Новый COMОбъект("Word.Application");
    Word.Visible = Ложь;
    Документ = Word.Documents.Add();
    
    // Заголовки таблицы
    Документ.Content.Text = "Код;Наименование;ДатаРождения;НомерТелефона;Email;ТипАбонемента" + Символы.ПС;
    
    // Получаем данные из справочника Клиенты
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    Клиенты.Код КАК Код,
        |    Клиенты.Наименование КАК Наименование,
        |    Клиенты.ДатаРождения КАК ДатаРождения,
        |    Клиенты.НомерТелефона КАК НомерТелефона,
        |    Клиенты.Email КАК Email,
        |    Клиенты.ТипАбонемента.Наименование КАК ТипАбонемента
        |ИЗ
        |    Справочник.Клиенты КАК Клиенты";
    
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    // Добавляем таблицу
    Таблица = Документ.Tables.Add(Документ.Content, РезультатЗапроса.Количество() + 1, 6);
    Таблица.Cell(1, 1).Range.Text = "Код";
    Таблица.Cell(1, 2).Range.Text = "Наименование";
    Таблица.Cell(1, 3).Range.Text = "ДатаРождения";
    Таблица.Cell(1, 4).Range.Text = "НомерТелефона";
    Таблица.Cell(1, 5).Range.Text = "Email";
    Таблица.Cell(1, 6).Range.Text = "ТипАбонемента";
    
    Для i = 1 По РезультатЗапроса.Количество() Цикл
        Выборка.Следующий();
        Таблица.Cell(i + 1, 1).Range.Text = Строка(Выборка.Код);
        Таблица.Cell(i + 1, 2).Range.Text = Строка(Выборка.Наименование);
        Таблица.Cell(i + 1, 3).Range.Text = Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy");
        Таблица.Cell(i + 1, 4).Range.Text = Строка(Выборка.НомерТелефона);
        Таблица.Cell(i + 1, 5).Range.Text = Строка(Выборка.Email);
        Таблица.Cell(i + 1, 6).Range.Text = Строка(Выборка.ТипАбонемента);
    КонецЦикла;
    
    Документ.SaveAs2(Путь);
    Документ.Close();
    Word.Quit();
КонецПроцедуры
